[ 
    "I’M ASHAMED, THAT I MADE YOU CRY. IN REGRET, I’M MISERABLY DROWNING. FOR YOUR FORGIVENESS, I’M DESPERATELY WAITING.",
    "I KNOW SAYING SORRY IS NOT ENOUGH\nTO MAKE YOU FEEL BETTER\nAND FORGIVE ME FOR WHAT I DID.\nI’LL SAY IT THOUGH, I’M DEEPLY SORRY.\nI DIDN’T MEAN TO HURT YOU.",
    "WHAT I DID WAS FOOLISH AND IMPULSIVE. IF I COULD TAKE IT ALL BACK I’D HAVE DONE IT THE INSTANT I LEARNT I HURT YOU.\n\nIT WAS TOTALLY UNINTENTIONAL AND I’M VERY SORRY FOR IT.\nPLEASE FORGIVE ME!"
    "ALL THESE DAYS IN WHICH YOU HAVE NOT BEEN BY MY SIDE, SADNESS AND LONELINESS HAVE BEEN MY COMPANIONS AND I MISS YOU MORE THAN EVER. YOU DO NOT KNOW HOW SORRY I AM, YOUR FORGIVENESS HAS BECOME MY MAIN GOAL.",
    "SOMETIMES I TAKE YOU FOR GRANTED, BUT I PROMISE IT’S ONLY BECAUSE I FEEL THAT YOU ARE THE ONLY ONE IN THE WHOLE WORLD WHO WILL UNDERSTAND ME FOR WHO I AM. I’M SORRY.",
    "SORRY MAY HAVE BECOME JUST ANOTHER WORD , BUT WITH TEARS IT MEANS THE WORLD. I AM SORRY FOR WHAT I HAVE DONE TO YOU.",
    "IF I CAN HAVE ANOTHER CHANCE, I WILL TAKE BACK THE WORDS I’VE SAID.\n\nI APOLOGIZE FOR CAUSING YOU PAIN AND HURTING YOUR FEELINGS.\n\nI HOPE YOU CAN FIND FORGIVENESS IN YOUR HEART.",
    "I KNOW I CAN’T DO ANYTHING TO CHANGE WHAT I DID IN THE PAST, BUT I PROMISE I’LL DO EVERYTHING I CAN TO GIVE US BOTH A BETTER FUTURE. I AM SORRY.",
    "WORDS ARE NOT ENOUGH TO MAKE YOU FEEL BETTER\nA SIMPLE SORRY WILL NEVER BE ENOUGH TO WASH AWAY THE PAIN I’VE CAUSED.\nSTILL, FROM THE BOTTOM OF MY HEART, I’M SO SORRY.\nI WISH I CAN MAKE IT UP TO YOU.",
    "YOU ARE MY WELL\nWHERE I THROW ALL MY SECRETS\nPLEASE DON’T BE ANGRY\nI AM REALLY SO SORRY",
    "MANY TEARS DROPPED FROM YOUR EYES BECAUSE OF THE WAY I HURT YOU. TODAY I PROMISE THAT I WILL CONVERT EVERY FALLEN TEAR OF YOURS INTO A PRECIOUS PEARL. I’M SORRY.",
    "I UNDERSTAND HOW SAD YOU ARE WITH ME RIGHT NOW BUT PLEASE I AM SORRY, I WILL CORRECT MY MISTAKES AND WILL SURELY MAKE IT UP TO YOU",
    "I AM SORRY THERE IS NOTHING IN THE WHOLE\nWORD THAT I WILL ALLOW TO COME IN BETWEEN\nRELATIONSHIP NOT EVEN MY OWN MISTAKE,I AM SORRY",
    "MY HEART WILL ROT IN THE GUILT BECAUSE\nI CAN NEVER FORGIVE MYSELF FOR WHAT I DID…\nBUT ALWAYS SEEK COMFORT BEATING FORGIVENESS.\nSORRY.",
    "I HURT YOU YESTERDAY\nI KNOW AT THAT TIME\nI AM SAD AFTER KNOWING THIS\nPLEAS DON’T BE ANGRY\nI AM SORRY",
    "Wish I could turn back the time\nAnd make things right?\nPlease forgive me!	",
    "I?m so sorry for hurting your feelings\nI take back my words!\nHope you?ll forgive me!",
    "Anytime you are angry, it breaks my heart\nBut my heart never stops loving you......\nSorry that I have hurt you!",
    "How can I begin to say I am sorry.\nI didn?t mean to upset you.\nI hope that you will forgive me.\nI am sorry.",
    "I have committed a sin to make u sad\nAnd am realising that I'm very bad\nSo plz forgive me to lessen the grief\nYour forgiveness will led to a relief\nI'm sorry!",
    "Remember d good times we spent together\nD beautiful future we dreamt of \nI never wanted to create a distance between us\nPlease forgive me n help me bridge d gap.",
    "I know you are angry \nI know what you must be going through \nI hope you know \nHow sorry I am for all \nThat happened between us\nPlease forgive me	",
    "I was no good, sorry for upsetting you and making you feel bad. Apologies.",
    "Yes, I was noisy and loud, my bad. Please forgive me. I am sorry.",
    "I was clingy and annoying... sorry... just afraid of losing you.",
    "I apologise not because I am wrong but because I value our relationship more than my ego.",
    "Love is a four letter word and sorry is 5, but when they walk together they make relationship shine",
    "I may have been wrong but if I don't do this. I'll never be right. I apologize..",
    "I won't say a word. The sweetest apologies are never said with the mouth but felt in the heart. I am sorry.",
    "Real relationship is when tears and not yet just smiles bring people closer. I am sorry for my actions.",
    "I understand that my action pained you. I'll work on it. Sorry!",
    "You are my true well-wisher and I am sorry my action hurt you. Take care. ",
    "I am not Perfect\nI make Mistakes\nI hurt People\nBut when i say SORRY\nI mean it.",
    "I cannot bear the pain of staying away from you anymore. Please forgive me and let's make our life beautiful again.",
    "My actions may have been the dark clouds,\nbut your forgiveness will be the silver lining.",
    "Take your time,\nDon't worry.\nI'll wait forever,\nIf that is what \nIt'll take for you\nto forgive me.. ",
    "I feel bad\nfor making you sad\nI feel guilty\nFor making you feel iffy\nI am sorry baby\nPlease forgive me.",
    "I am sorry, I couldn't handle all that stress. Won't speak like that again.",
    "I feel so ashamed that i showed my worst side to the best thing that has ever happed to me.",
    "I know I have left a mess for you to sort out; trust me, it was inadvertent. My thousand apologies.",
    "For everything I did, I am sorry. I truly never meant it.",
    "I know taking my words back won't lessen the pain I have caused to you. I deeply regret for all the things. I am sorry.",
    "For all my stupidity, the only thing I can ask for is your forgiveness. I am sorry!",
    "I'm really feeling very sorry. Sometimes I say or do the wrong things at the wrong time, though I never intend to hurt you. But sometimes I know I do .. I don't know how to make things better but I can start by saying, I'm really very sorry.",
    "The intention was not to hurt you. My bad, I couldn't control the outcome. I am sorry.",
    "Your trust is priceless. I want you to know that the error was inadvertent. I am sorry and I will make amends.",
    "You are right! I was wrong and I could have handled it with more maturity. I am sorry. ",
    "I know I was wrong and I am ready to correct my mistakes. All I need is your forgiveness.",
    "I am sorry for what I did. Can you give me a chance to get everything in place?",
    "Our future hangs on this note of apology! Accept it and change my life forever. ",
    "I need you in my life, I am sorry.",
    "My world is a better place because of you. Don’t walk away. I am sorry.",
    "I love you deeply and apologize for hurting you.",
    "You've always been the mature one between us two. Forgive me like you always do.",
    "It takes a strong person to say sorry, but a stronger person to show forgiveness.",
    "Although I may have a hot temper, it is not hotter than you. Please, please, please forgive me.",
    "You are brilliant, I am not. I am sorry to have hurt you :(",
    "You display abundance of patience & tolerate me, sorry, would take care next time.",
    "I am sorry, my actions really hurt you. I am feeling sad about it. Won't repeat.",
    "Your smile means a lot to me, sorry to rob you of that. Won't happen again. ",
    "I know, I shouldn't step on your toes. Still I do. I am feeling sad and I am sorry for the same. Love you!	",
    "I know I've hurt u\nI didn't mean to.\nI m soooo sorry\nPlz forgive me!",
    "I have all ways made mistakes so\nhas every one but my biggest mistake\nis letting you go and if you take me back\nI will never make a mistake as big as\nthis one ever again. I M SORRY	",
    "I want to forgive and forget. But unless you forgive, I can’t forget!",
    "I know I was wrong. I hope you can forgive me. Let’s give our love another chance and I will be the right guy for you.",
    "Angry is ugly, forgiveness is sexiness. Forgive me please?",
    "I’ve been a fool, and I know that ain’t cool. I’m so sorry my love. Hoping your push won’t turn to shove. Forgive me please.",
    "My heart has been leaking and bleeding since the day I hurt you. Please plug the holes with your forgiveness. I am sorry.",
    "I overlooked your happiness in an attempt to make myself happy, only to realize that my happiness lies in yours. I am sorry, please forgive me.",
    "I trust fate and I believe in love, which is why I know you’ll accept my apology. I’m sorry.",
    "I want you to know that I am sorry. It was all me to blame. I love you and I will be true to you forever. Please forgive me.",
    "Regret, heartbreak and sadness, have stolen my life’s happiness. I am sorry for letting you down, but I promise to erase your frowns.",
    "I miss you so bad. It was wrong of me to hurt you that way and I am really sorry. Forgive me love, and I’ll show you how much I care.",
    "I am not perfect but I’m still me. The same guy who holds you in his arms because you’re all that matter to him. I’m sorry.",
    "I want you to know that I love you with all my heart. In a relationship, it’s normal to encounter some misunderstandings but in my part, it’s me who wants to ask for an apology. I’m sorry and I will not hurt you again. I love you!",
    "I know you’re angry but I want you to think about all the beautiful memories, that have made us believe that we’re meant to be. I am sorry.",
    "I am sorry for all the mistakes and hurts that I’ve caused you. I love you dear from the bottom of my heart. I didn’t mean to hurt your feelings. I promise I will never hurt you again.",
    "My love for you makes the ground shake, it’s strong enough to shatter the earth itself, like my heart, shattered when you left me. I know it was my fault, and I am sorry for everything I’ve done so please, come back to me. I love you.",
    "I feel so terrible about the pain I’ve caused you to feel. Please forgive me, and allow me the opportunity to help heal your wounded heart.",
    "I’ve been a complete idiot for a very long time now. I am fully aware of what I’ve done, and I regret every single thing. I wish for you to come back to my loving arms, and act like none of this ever happened. I love you and I am sorry.",
    "I’ve realized the foolishness and insensitivity of my actions and I want a chance to show you that I’ve really changed. Will you forgive me, please?",
    "I’m haunted day and night by thoughts of the pain my words and actions have caused you. The thought of you crying makes me feel so horrible. Please forgive me!",
    "I never, ever want to make you feel hurt like this again. I’m so, so sorry for the way I treated you. Will you please forgive me?",
    "They say you don’t appreciate what you have until you’ve lost it. And I can now say that it is true, your absence is driving me crazy and I cannot handle it anymore. Please forgive me for everything I’ve done and come back to me. I love you.",
    "I am so incredibly sorry that I was so thoughtless with my choice of words. What I said truly didn’t express my intention, and I’m so sorry that my insensitivity hurt you. Will you please forgive me?",
    "You are an amazing, strong woman. Thank you for standing up to me, showing me how wrong I was, and forcing me to take a good, hard look at myself in the mirror. I didn’t like what I saw, so I’ve made some changes. Please forgive me and give me a chance to show you how I’ve changed.",
    "I finally saw the light and realized how wrong I was in treating you the way I did. I am extremely sorry for all the pain I caused you. Will you please forgive me?",
    "I don’t deserve your forgiveness, but I am begging for it because I miss you so much I can’t stand it. I love you and I’m so, so sorry I hurt you! Will you please forgive me?",
    "There’s nothing I want more than to see you happy again. I am so sorry for causing you to feel hurt. Will you please forgive me?",
    "We all make mistakes, some are big some are small. But I don’t think that we should let our mistakes define us. So please, remember all the good things we’ve been through, and imagine the ones we will go through in the future. And when you do that, please reconsider your decision and forgive me for all I’ve done. I love you.",
    "I know that I am a terrible person, I know I am a fool, but at least, I’m your fool. I am sorry, forgive me for what I’ve done. I love you.",
    "I just want you to know that I feel empty without you. I cannot stand waking up without you by my side. I know that what I did was idiotic, and I am fully capable of setting things straight for us, but I just want you to forgive me and give me another chance. I love you.",
    "Please forgive me for the insensitivity I showed to you and allow me a chance to prove that I’ve changed.",
    "I’ve been extremely insensitive, both with my words, and my actions. Please forgive me!",
    "You are such an incredibly unique and precious lady. I’m so sorry to have taken you for granted. Will you please forgive me?",
    "The way I’ve acted lately has not been a true expression of the way I feel about you. My actions haven’t been loving. I’m so sorry!",
    "Please forgive me for not living up to the image I tried to portray. In the future, if you forgive me, I’ll work hard to make sure my actions match my words!",
    "You’re truly a beautiful, exquisite princess. You deserve a knight in shining armor, who will always seek to love, cherish, and protect you from harm. I’m so sorry for failing in my role. From now on, I pledge to be the kind of knight you deserve!",
    "A woman as rare and special as you are is like a precious jewel. I’m so incredibly sorry for the way I’ve treated you. If you find it in your heart to forgive me, in the future I will treat you like the cherished treasure you are.",
    "Darling, you deserve far, far better than the way I’ve treated you. Please forgive me and allow me to come back into your life.",
    "Please forgive my foolish, insensitive words and actions and allow me the chance to change and grow into the kind of man you truly deserve.",
    "You’re beautiful, both inside and out. A woman as rare and amazing as you are ought to be treated with the utmost love, care, and respect. I’m so sorry I dropped the ball as your boyfriend. Please forgive me.",
    "I haven’t been able to stop thinking about all the ways I let you down. Please forgive me and give me another chance.",
    "I’m not going to make any excuses for what I’ve done or said because my words and actions are inexcusable. Instead, I want to offer my most sincere apology and express my hope that you’ll forgive me and we can get back together again so I can show you that I’ve learned from my past.",
    " will wait for your to the eternity if that’s what it takes to earn your forgiveness.\nSorry dear. I understand my mistake.",
    "Our relation was supposed to be immune to the earthly diseases called fighting, arguing and lies. Now i have to take the counter measure called sorry to save this beautiful relationship.\nI am really sorry baby.",
    "Your bitterness is something i can not stand. Please forgive me for my mistakes and let us continue our sweet relation again.",
    "You are my strength, yet you are angry to me. I feel very weak and exposed. Please accept my deepest apologies and let us unite again. We are not meant to be apart.",
    "You are the best thing that ever happened to me and i was really stupid to not realize that till now. I know i have made a lots of mistakes, but give me another chance. I will never let you leave me again. I am really very sorry.",
    "They say that everything happens for the best. This small fight of ours made me realize your worth to me. I don’t ever want to fight you again. I love you so much and i am very very sorry. Please forgive me.",
    "I have an utmost trust in the God and i know that you will forgive me soon. Till then i am waiting.\nI am sorry for everything.",
    "I want to be your pillow again for all the nights to come. I want to take care of you all the night and all the day. I miss you, baby. I want to hug you again. I want to feel you again. I can not bear anymore. Please forgive me baby. I deeply regret our fight. Give me another chance.",
    "After you have left me, it seems like my life has stopped. I am stuck with you. My heart and my memories are still living in the past. I love you so much. I am really very sorry for what happened.\nPlease forgive me.",
    "After leaving you, my life has thrown all the hardships on me, and I realize that you are my lucky charm, without you, I can not even face a single hardship. I guess that was nature’s way of reminding me about my biggest mistake. I am sorry, and I miss you so much. I hope you feel the same about me.",
    "I know that we have moved apart, but you are still living inside my heart. I don’t know I want to give our relationship another chance. I miss you so much and i am really very sorry for everything.",
    "know that i am the one who always starts an argument. I know i have done many mistakes and i realize that now, Please forgive and give me another chance. I am really sorry.",
    "I am very sorry and i want to make it up to you. Forgive me babe. Apologizing is not a bad feeling after all.",
    "Your main objective for this separation is to make me realize my mistakes. I understand now and i am very sorry baby. I was being stupid. Please come back now.",
    "I know the value of your smile and after this fight, i realize how much you mean to me. You are my one and only love and i want you to forgive me please. I apologize for everything.",
    "This sorry is not only because of my mistakes. This sorry is also because i value this relationship more than my pride and men’s pride is something that is above everything else.\n\nPlease forgive me. I am sorry!",
    " still can not imagine how stupid i am to be the reason of our separation, all i ever wanted for us to be together.\nI am sorry babe, please forgive me.",
    "On my road to redemption. I could think of nothing else other than hurting you. I want to make everything right if you give me another chance. I miss you so much, and I know my mistakes now. I am very sorry my love.",
    "This fight made me realize, how much important you are for me.\nI am very sorry.",
    "I took the first wrong step to damage this relation but i expect you to take the right step and save it from breaking. I love you and i am very sorry for my dumbness.",
    " am still living in the beautiful memories of our time together and i enjoyed those moments. I realize now that i have lost a treasure and i want to apologize for my mistakes. Please forgive me.",
    "I really though that I am very strong but ever since you have left me, I feel so weak, and I realize that the source of my strength was your love. I miss you so much. I am very sorry. Please forgive me.",
    "o one is perfect and i know i have more faults than other people but you are the only one i have given my heart because i knew it that only you are meant to hold it. 🙂\nPardon, my lady.",
    "I will wait for your forgiveness till death if you don’t forgive me now.",
    "I can not stand even a single second seeing this painful look on your face.\nBaby i am really sorry.",
    "Difficult time has passed painfully, but your memories still make me want to cry.\nI just want another chance to make it up to you. Please forgive me.",
    "As a girlfriend, it is your right to be angry with me for my mistakes. But as a boyfriend, it is my job to make amends and never stop trying till i earn my forgiveness.\n\nBaby, i sincerely apologize. Please forgive my childish behaviour.",
    "I am going through our last chat again. I am looking at your pictures. I am even stalking you on your social circle. You know, these are my habits when I miss you, and I can not do anything about that. Please forgive me for my mistakes. I just want to hold you in my arms right now.",
    "Every man should be given another chance. Because men are prideful and stupid.\nI realize my mistake and i ask for your forgiveness."
]
