[
	"I did not realize how much you worth and I was guided just by appearances, things are not the same when I’m with you, I need your love, your advice. I really apologize. If you want, I kneel before you to end this situation. I wish we can have a relationship full of love and peace. I love you with all my heart.",
	"My darling, I feel terrible for what I did, can you please forgive me? Since I’m by your side you have supported me in everything, I need you please! you complete me!. My life, I ask you to forgive me and give me a chance to correct my mistakes, I’m willing to do whatever you want to fix this situation.",
	"Please let me show you that I have changed and I feel very sorry for what I did, I beg you to apologize me and let me stay with you. Let’s start our relationship again. Please receive my apologies to return harmony to our hearts and I guarantee you it will never happen again. I’m willing to do anything you ask to have your forgiveness.",
	"Once again I come back to beg you to forgive me, I made a mistake, I ignored your warnings and your good advice, I judged you the wrong way and I did not believe in what you said. It’s sad to wake up every day thinking that I hurt you. If you don’t forgive me now, I will understand, but I promise you I will move heaven and earth to gain that forgiveness.",
	"You always look gorgeous and beautiful and I made you look so ugly the other day by causing you pain. I’m really sorry beautiful.",
	"Being alone today made me realize my mistakes and I want you to know that I regret my actions. I’m so sorry my woman.",
	"No vows or promises, I just want to say that I’m truly and really sorry my princess.",
	"I hope by hugging and telling you how much you mean to me will create a place in your heart to forgive me. I’m so sorry my love.",
	"I want you to know that I still love and care about you, even though I hurt your feelings. I’m really sorry my angel.",
	"I only want you to look into my eyes and see how sorry I am for having cause you pains. I’m so sorry my baby. Can you please forgive me?",
	"A day like this, I wish I had the power to cleanse all the terrible things I did to hurt you. I’m really sorry my love.",
	"Saying that I’m sorry doesn’t really matter much as showing you how much I mean those three words – I’m Truly Sorry.",
	"Didn’t know that being too jealous will bring about this pain and ache to you. I’m so sorry dear.",
	"My flaws and shortcomings are always before me, but I vow to be a better person next time. I’m sorry my love.",
	"The feeling of being without you, I can’t help nor stand it anymore. I’m very sorry my princess.",
	"I know now it’s not cool to hurt you or take you for granted. I’m deeply sorry sweetheart.",
	"It pains me when I’m the reason behind why you’re angry. I’m so sorry my baby.",
	"I know that you are truly hurt now, I could only hope this will make it up to you – I Am Truly Sorry My Love.",
	"All that matters right now is that I still love you beyond words, please accept my apology. I’m sorry beautiful.",
	"Please accept my apology, I promise to cherish and love you more than ever before. I’m sorry for everything.",
	"Henceforth I will always be real and true to you, my dear. I’m so sorry my baby. Please forgive me.",
	"Go ahead and blame it all on me, because it was all my fault. I’m really sorry sweetheart.",
	"It was wrong of me to take advantage of you or your kind gesture. I’m very sorry my love.",
	"I hope you can forgive me and give me another chance to prove my love for you. I’m truly sorry my baby.",
	"I may have been wrong but if I don’t do this, I’ll never be right. I apologize.",
	"If I could avoid what happened, I would, but since I can’t, I’ll apologize.",
	"You are the kindest person I have met. Forgive this fool who can’t live without you.",
	"Our future hangs on this note of apology! Accept it and change my life forever.",
	"I know saying sorry once won’t help. So here… sorry * infinity. Accept my apologies.",
	"The hardest to say but the easiest to acknowledge is a five letter word – Sorry. I said it, will you acknowledge it?",
	"Saying sorry can revive our relationship and let it blossom like before. I miss you sweetheart and I love you.",
	"I am sorry if I hurt you, I didn’t mean to. You are the love of my life. Come back to me.",
	"S-O-R-R-Y.",
	"For old times’ sake, accept my apology. I want to be with you again, don’t keep me away.",
	"Our relationship is important to me and here comes a sorry for you to forgive me and forget what I said.",
	"My world is a better place because of you. Don’t walk away. I am sorry.",
	"If you won’t hold me, I’ll cry, if you won’t be with me, I may not survive and if you don’t accept this apology, I’ll surely die.",
	"I apologize not because I am wrong but because I value our relationship more than my ego.",
	"Saying sorry is the first step to restoring a broken relationship. I said it but will you accept it?",
	"The genie granted me 1 wish. I asked for world peace. ‘No’ he said. I asked for your forgiveness. He said he he’d try world peace.",
	"You are the brightest ray of light in my life. Your anger makes my world dark. Please forgive me.",
	"You are as sweet as honey. You are as bright as the sun. If you accept my apology, you’ll be my number 1.",
	"Things were said in haste, things happened against fate, but if you do accept my apology, everything will be better again.",
	"If not for me, accept this apology for the bond we share.",
	"I hope you accept this apology, for it comes not only with the deepest regrets but with feelings so pure, that it’d make a pearl seem tainted.",
	"Words are rare for a feeling so pure, saying sorry won’t suffice.",
	"If I could take back my words I would, but since I can’t – here is a new set: I am sorry!",
	"You have the heart of an angel; forgive me my love, for I will never do this again.",
	"I may not be the best but I love you better than the rest, accept my apologies and be mine again.",
	"Our life is like a flower in spring. If you leave, you’ll take away the essence! Come back and let’s be together again.",
	"If I could, I would take back all the things I did to hurt you. But since I can’t, please make do with my apologies.",
	"I feel like I am the worst, most awful person in the entire world. I am so, so sorry for getting angry at you. I promise that I will never do it again if only you will just forgive me, my love.",
	"I never wanted to make you angry. You are so beautiful when you smile, and it is my fault that the smile left your face. Please forgive me and smile again, my dear.",
	"I am so sorry that I was being clingy. I just cannot get enough of you. You are the only thing that is ever on my mind.",
	"They say that every couple fights, but I wish that we never had to have a bad day. I am so sorry that I was the reason we had a fight. I was wrong, and I am sorry.",
	"Sticks and stones may break our bones, but words can hurt too. I never realized the harm words could do until I hurt you with them. I am so sorry—what said is truly unforgivable.",
	"I promise that I will try to think more before I speak. I did not mean the things that I said to you, but I was so angry that I said anything, even when it was not true. I hope you know that I did not mean what I said. I need to have you as a part of my life",
	"I don’t know what I can say other than to apologize for being such a jerk. If you could find it in yourself to look past my mistakes and forgive me, I will do my best to stop being such a jerk and to become the person you deserve.",
	"You are the brightest ray of sunshine in my entire life. When you are upset with me, my world goes dark. Please forgive me so that my world can be light again.",
	"I hope that you will accept my apology. It comes with the deepest regrets and love. I wish that I could be the person you deserve, but I will have to keep trying.",
	"Your spirit and love are so pure that even a pearl would feel tainted. If only I was worthy of that. I am so sorry for showing you just how little I deserve you. If you will forgive me, I will try to be a better person.",
	"I was a stupid idiot. You deserve better, and I will try to become a better person. I am so sorry—will you please forgive me?",
	"I am desolate without you. Please forgive me.",
	"I am sorry. All I want to do is to have our relationship blossom as strong as it did before. I miss you, sweetheart. Please forgive me.",
	"I have caused you so much pains in your heart and Yet full of regret, I can’t still turn back the hands of time and now the only thing I have left to do is to beg for your forgiveness please forgive me I’m sorry.",
	"Life without forgiveness is a life without achievements. I’m sorry from the depths of my heart. Please forgive me.",
	"I did be lying if I told you losing you were something I could handle. Can you come back to me please?",
	"I know I’ve done you wrong and my conscience is judging me. I’m truly sorry; forgive me so I can have a rest of mind. Please I’m sorry.",
	"I hurt you now but that doesn’t mean I hate you also. Honey I’m sorry I did you wrong.",
	"Whether intentional or not, I know that I’ve hurt you and I’m sorry from the bottom of my heart. Please forgive me.",
	"One thing I never wanted to see is your tears, but now I am the one making you cry. It’s hard to accept that we can’t be together. I’m sorry.",
	"There is always a room for forgiveness. Find it in your heart and give us a chance",
	"There are many times I treat you wrong. Please forgive me and I promise you no more such undeserving treatments.",
	"I know I hurt you and now you hate me but please try to find a place in your heart to forgive me.",
	"Sometimes when I hurt you, I just hope that you’ll forgive me because I’ve never meant to.",
	"Forgive me whatever I did, I’ve never meant to hurt you. You’re my one and only love.",
	"As I walked out of my house today, I realized I was missing something, and that something was you. Please be mine again.",
	"I do not get to see you as often as I like, I do not get to hold you all through the night, but deep in my heart this much I know. You are the one for me and I will never let you go. Please come back to me.",
	"Like a bee I stung you with my previous actions,I am very sorry honey I hope you forgive me for the sake of better days ahead.",
	"I am sorry for being human who is prone to making mistakes,please forgive  my angel.",
	"I have wept all day long because my heart bites me for hurting you this much.I am sorry.",
	"My weakness is no excuse for hurting you,please find a place in your heart to forgive me and give me strength to come alive again.",
	"There is no perfect excuse for my mistake,but I am not perfect so kindly excuse my errors and forgive me.",
	"I am your greatest fan but I am so sorry to have hurt you like a blade ,I hope you forgive me so that I can be cool again because my life feels terribly hot without you.",
	"I never meant to take you for granted,please I beg you to grant me a pardon for my mistake.",
	"I feel so negative because of my actions towards you,please make me a positive person again by forgiving me.",
	"I feel so sad and lonely because my better half is angry with me,please play your angelic role in my life by forgiving me and making me whole again.",
	"Please don’t hate me for my past mistakes because there is still enough love to last us through the future.I am very sorry.",
	"I cannot undo my mistake but I can correct it by saying a big sorry for being a jerk.See my jerk face.",
	"I’m imprisoned by the guilt I feel over my mistake,please forgive me and release my silly action from your mind.",
	"Not everything is what it seems,my mistake was not deliberate and I to apologize for it because what matters is I love you.",
	"To err is human to forgive is divine.I erred , please find it within your divine heart to forgive me because you are my angel.",
	"Don’t turn your back on our love because of my mistake,please leave the past behind, and let us embrace a better tomorrow starting from now. I am truly sorry.",
	"I am trembling as I type this because my eyes hurt with tears,my fingers are feeble with pain and my heart is burning with regret for hurting you. I am truly sorry.",
	"Text can’t reveal the content of my heavy heart that feel so bad for hurting you. I am sorry honey.",
	"My mistake is inexcusable so I want you to kindly pardon me for behaving so horribly wrong. I am truly sorry.",
	"Perfect love has no manual for such an imperfect world, so bear my imperfection and forgive me for the sake of our love.",
	"Love they say is blind, but I can clearly see how much I hurt you with my mistake, please forgive me and turn a blind eye against my mistake.",
	"Baby cupid is mad at me for hurting you, please forgive me and allow love to continue its perfect job in our lives.",
	"I acted immature please be matured enough to pardon my childish act.",
	"Unconditional love forgives conditions such as mistakes,please let your love pardon me for my unintentional errors.",
	"I never believed I could hurt you this much,please believe I am truly sorry for my mistake.",
	"The truth is that I fumbled but the fact is I never meant to,the question can you forgive me ? Please pardon my truly sorry heart for hurting you.",
	"I respect you more than my wrong act could ever show,please give a clean chance to prove how truly sorry I am.",
	"Saying I am sorry is not easy because it shows one is at fault.please I am so sorry for causing you pain through my act.",
	"A billion I am sorry text is not enough to measure the hurt I feel over my mistake. Please give me the chance to make it up to you.",
	"I should get locked up for hurting such a special person as you , I promise not to make this mistake again. I am truly sorry.",
	"Sometimes, you hurt the one’s you love the most. I promise to make it better if you give “us” one more chance.",
	"Your love is my drug and you must know, I’m terribly addicted to you.",
	"Every minute without you feels like precious time gone down the drain. Please let's not waste any more of it?"
]
