[
	"I’M ASHAMED, THAT I MADE YOU CRY. IN REGRET, I’M MISERABLY DROWNING. FOR YOUR FORGIVENESS, I’M DESPERATELY WAITING.",
	"I KNOW SAYING SORRY IS NOT ENOUGH\nTO MAKE YOU FEEL BETTER\nAND FORGIVE ME FOR WHAT I DID.\nI’LL SAY IT THOUGH, I’M DEEPLY SORRY.\nI DIDN’T MEAN TO HURT YOU.",
	"WHAT I DID WAS FOOLISH AND IMPULSIVE. IF I COULD TAKE IT ALL BACK I’D HAVE DONE IT THE INSTANT I LEARNT I HURT YOU.\n\nIT WAS TOTALLY UNINTENTIONAL AND I’M VERY SORRY FOR IT.\nPLEASE FORGIVE ME!",
	"ALL THESE DAYS IN WHICH YOU HAVE NOT BEEN BY MY SIDE, SADNESS AND LONELINESS HAVE BEEN MY COMPANIONS AND I MISS YOU MORE THAN EVER. YOU DO NOT KNOW HOW SORRY I AM, YOUR FORGIVENESS HAS BECOME MY MAIN GOAL.",
	"SOMETIMES I TAKE YOU FOR GRANTED, BUT I PROMISE IT’S ONLY BECAUSE I FEEL THAT YOU ARE THE ONLY ONE IN THE WHOLE WORLD WHO WILL UNDERSTAND ME FOR WHO I AM. I’M SORRY.",
	"SORRY MAY HAVE BECOME JUST ANOTHER WORD , BUT WITH TEARS IT MEANS THE WORLD. I AM SORRY FOR WHAT I HAVE DONE TO YOU.",
	"IF I CAN HAVE ANOTHER CHANCE, I WILL TAKE BACK THE WORDS I’VE SAID.\n\nI APOLOGIZE FOR CAUSING YOU PAIN AND HURTING YOUR FEELINGS.\n\nI HOPE YOU CAN FIND FORGIVENESS IN YOUR HEART.",
	"I KNOW I CAN’T DO ANYTHING TO CHANGE WHAT I DID IN THE PAST, BUT I PROMISE I’LL DO EVERYTHING I CAN TO GIVE US BOTH A BETTER FUTURE. I AM SORRY.",
	"WORDS ARE NOT ENOUGH TO MAKE YOU FEEL BETTER\nA SIMPLE SORRY WILL NEVER BE ENOUGH TO WASH AWAY THE PAIN I’VE CAUSED.\nSTILL, FROM THE BOTTOM OF MY HEART, I’M SO SORRY.\nI WISH I CAN MAKE IT UP TO YOU.",
	"YOU ARE MY WELL\nWHERE I THROW ALL MY SECRETS\nPLEASE DON’T BE ANGRY\nI AM REALLY SO SORRY",
	"MANY TEARS DROPPED FROM YOUR EYES BECAUSE OF THE WAY I HURT YOU. TODAY I PROMISE THAT I WILL CONVERT EVERY FALLEN TEAR OF YOURS INTO A PRECIOUS PEARL. I’M SORRY.",
	"I UNDERSTAND HOW SAD YOU ARE WITH ME RIGHT NOW BUT PLEASE I AM SORRY, I WILL CORRECT MY MISTAKES AND WILL SURELY MAKE IT UP TO YOU",
	"I AM SORRY THERE IS NOTHING IN THE WHOLE\nWORD THAT I WILL ALLOW TO COME IN BETWEEN\nRELATIONSHIP NOT EVEN MY OWN MISTAKE,I AM SORRY",
	"MY HEART WILL ROT IN THE GUILT BECAUSE\nI CAN NEVER FORGIVE MYSELF FOR WHAT I DID…\nBUT ALWAYS SEEK COMFORT BEATING FORGIVENESS.\nSORRY.",
	"I HURT YOU YESTERDAY\nI KNOW AT THAT TIME\nI AM SAD AFTER KNOWING THIS\nPLEAS DON’T BE ANGRY\nI AM SORRY.",
	"Wish I could turn back the time\nAnd make things right?\nPlease forgive me!",
	"I?m so sorry for hurting your feelings\nI take back my words!\nHope you?ll forgive me!",
	"Anytime you are angry, it breaks my heart\nBut my heart never stops loving you......\nSorry that I have hurt you!",
	"How can I begin to say I am sorry.\nI didn?t mean to upset you.\nI hope that you will forgive me.\nI am sorry.",
	"I have committed a sin to make u sad\nAnd am realising that I'm very bad\nSo plz forgive me to lessen the grief\nYour forgiveness will led to a relief\nI'm sorry!",
	"Remember d good times we spent together\nD beautiful future we dreamt of \nI never wanted to create a distance between us\nPlease forgive me n help me bridge d gap.",
	"I know you are angry \nI know what you must be going through \nI hope you know \nHow sorry I am for all \nThat happened between us\nPlease forgive me",
	"I was no good, sorry for upsetting you and making you feel bad. Apologies.",
	"Yes, I was noisy and loud, my bad. Please forgive me. I am sorry.",
	"I was clingy and annoying... sorry... just afraid of losing you.",
	"I apologise not because I am wrong but because I value our relationship more than my ego.",
	"Love is a four letter word and sorry is 5, but when they walk together they make relationship shine",
	"I may have been wrong but if I don't do this. I'll never be right. I apologize..",
	"I won't say a word. The sweetest apologies are never said with the mouth but felt in the heart. I am sorry.",
	"Real relationship is when tears and not yet just smiles bring people closer. I am sorry for my actions.",
	"I understand that my action pained you. I'll work on it. Sorry!",
	"You are my true well-wisher and I am sorry my action hurt you. Take care. ",
	"I am not Perfect\nI make Mistakes\nI hurt People\nBut when i say SORRY\nI mean it.",
	"I cannot bear the pain of staying away from you anymore. Please forgive me and let's make our life beautiful again.",
	"My actions may have been the dark clouds,\nbut your forgiveness will be the silver lining.",
	"Take your time,\nDon't worry.\nI'll wait forever,\nIf that is what \nIt'll take for you\nto forgive me.. ",
	"I feel bad\nfor making you sad\nI feel guilty\nFor making you feel iffy\nI am sorry baby\nPlease forgive me.",
	"I am sorry, I couldn't handle all that stress. Won't speak like that again.",
	"I feel so ashamed that i showed my worst side to the best thing that has ever happed to me.",
	"I know I have left a mess for you to sort out; trust me, it was inadvertent. My thousand apologies.",
	"For everything I did, I am sorry. I truly never meant it.",
	"I know taking my words back won't lessen the pain I have caused to you. I deeply regret for all the things. I am sorry.",
	"For all my stupidity, the only thing I can ask for is your forgiveness. I am sorry!",
	"I'm really feeling very sorry. Sometimes I say or do the wrong things at the wrong time, though I never intend to hurt you. But sometimes I know I do .. I don't know how to make things better but I can start by saying, I'm really very sorry.",
	"The intention was not to hurt you. My bad, I couldn't control the outcome. I am sorry.",
	"Your trust is priceless. I want you to know that the error was inadvertent. I am sorry and I will make amends.",
	"You are right! I was wrong and I could have handled it with more maturity. I am sorry. ",
	"I know I was wrong and I am ready to correct my mistakes. All I need is your forgiveness.",
	"I am sorry for what I did. Can you give me a chance to get everything in place?",
	"Our future hangs on this note of apology! Accept it and change my life forever. ",
	"I need you in my life, I am sorry.",
	"My world is a better place because of you. Don’t walk away. I am sorry.",
	"I love you deeply and apologize for hurting you.",
	"You've always been the mature one between us two. Forgive me like you always do.",
	"It takes a strong person to say sorry, but a stronger person to show forgiveness.",
	"Although I may have a hot temper, it is not hotter than you. Please, please, please forgive me.",
	"You are brilliant, I am not. I am sorry to have hurt you :(",
	"You display abundance of patience & tolerate me, sorry, would take care next time.",
	"I am sorry, my actions really hurt you. I am feeling sad about it. Won't repeat.",
	"Your smile means a lot to me, sorry to rob you of that. Won't happen again.",
	"I know, I shouldn't step on your toes. Still I do. I am feeling sad and I am sorry for the same. Love you!",
	"I know I've hurt u\nI didn't mean to.\nI m soooo sorry\nPlz forgive me!",
	"I have all ways made mistakes so\nhas every one but my biggest mistake\nis letting you go and if you take me back\nI will never make a mistake as big as\nthis one ever again. I M SORRY",
	"I want to forgive and forget. But unless you forgive, I can’t forget!",
	"I know I was wrong. I hope you can forgive me. Let’s give our love another chance and I will be the right guy for you.",
	"Angry is ugly, forgiveness is sexiness. Forgive me please?",
	"I’ve been a fool, and I know that ain’t cool. I’m so sorry my love. Hoping your push won’t turn to shove. Forgive me please.",
	"My heart has been leaking and bleeding since the day I hurt you. Please plug the holes with your forgiveness. I am sorry.",
	"I overlooked your happiness in an attempt to make myself happy, only to realize that my happiness lies in yours. I am sorry, please forgive me.",
	"I trust fate and I believe in love, which is why I know you’ll accept my apology. I’m sorry.",
	"I want you to know that I am sorry. It was all me to blame. I love you and I will be true to you forever. Please forgive me.",
	"Regret, heartbreak and sadness, have stolen my life’s happiness. I am sorry for letting you down, but I promise to erase your frowns.",
	"I miss you so bad. It was wrong of me to hurt you that way and I am really sorry. Forgive me love, and I’ll show you how much I care.",
	"I am not perfect but I’m still me. The same guy who holds you in his arms because you’re all that matter to him. I’m sorry.",
	"I want you to know that I love you with all my heart. In a relationship, it’s normal to encounter some misunderstandings but in my part, it’s me who wants to ask for an apology. I’m sorry and I will not hurt you again. I love you!",
	"I know you’re angry but I want you to think about all the beautiful memories, that have made us believe that we’re meant to be. I am sorry.",
	"I am sorry for all the mistakes and hurts that I’ve caused you. I love you dear from the bottom of my heart. I didn’t mean to hurt your feelings. I promise I will never hurt you again.",
	"My love for you makes the ground shake, it’s strong enough to shatter the earth itself, like my heart, shattered when you left me. I know it was my fault, and I am sorry for everything I’ve done so please, come back to me. I love you.",
	"I feel so terrible about the pain I’ve caused you to feel. Please forgive me, and allow me the opportunity to help heal your wounded heart.",
	"I’ve been a complete idiot for a very long time now. I am fully aware of what I’ve done, and I regret every single thing. I wish for you to come back to my loving arms, and act like none of this ever happened. I love you and I am sorry.",
	"I’ve realized the foolishness and insensitivity of my actions and I want a chance to show you that I’ve really changed. Will you forgive me, please?",
	"I’m haunted day and night by thoughts of the pain my words and actions have caused you. The thought of you crying makes me feel so horrible. Please forgive me!",
	"I never, ever want to make you feel hurt like this again. I’m so, so sorry for the way I treated you. Will you please forgive me?",
	"They say you don’t appreciate what you have until you’ve lost it. And I can now say that it is true, your absence is driving me crazy and I cannot handle it anymore. Please forgive me for everything I’ve done and come back to me. I love you.",
	"I am so incredibly sorry that I was so thoughtless with my choice of words. What I said truly didn’t express my intention, and I’m so sorry that my insensitivity hurt you. Will you please forgive me?",
	"You are an amazing, strong woman. Thank you for standing up to me, showing me how wrong I was, and forcing me to take a good, hard look at myself in the mirror. I didn’t like what I saw, so I’ve made some changes. Please forgive me and give me a chance to show you how I’ve changed.",
	"I finally saw the light and realized how wrong I was in treating you the way I did. I am extremely sorry for all the pain I caused you. Will you please forgive me?",
	"I don’t deserve your forgiveness, but I am begging for it because I miss you so much I can’t stand it. I love you and I’m so, so sorry I hurt you! Will you please forgive me?",
	"There’s nothing I want more than to see you happy again. I am so sorry for causing you to feel hurt. Will you please forgive me?",
	"We all make mistakes, some are big some are small. But I don’t think that we should let our mistakes define us. So please, remember all the good things we’ve been through, and imagine the ones we will go through in the future. And when you do that, please reconsider your decision and forgive me for all I’ve done. I love you.",
	"I know that I am a terrible person, I know I am a fool, but at least, I’m your fool. I am sorry, forgive me for what I’ve done. I love you.",
	"I just want you to know that I feel empty without you. I cannot stand waking up without you by my side. I know that what I did was idiotic, and I am fully capable of setting things straight for us, but I just want you to forgive me and give me another chance. I love you.",
	"Please forgive me for the insensitivity I showed to you and allow me a chance to prove that I’ve changed.",
	"I’ve been extremely insensitive, both with my words, and my actions. Please forgive me!",
	"You are such an incredibly unique and precious lady. I’m so sorry to have taken you for granted. Will you please forgive me?",
	"The way I’ve acted lately has not been a true expression of the way I feel about you. My actions haven’t been loving. I’m so sorry!",
	"Please forgive me for not living up to the image I tried to portray. In the future, if you forgive me, I’ll work hard to make sure my actions match my words!",
	"You’re truly a beautiful, exquisite princess. You deserve a knight in shining armor, who will always seek to love, cherish, and protect you from harm. I’m so sorry for failing in my role. From now on, I pledge to be the kind of knight you deserve!",
	"A woman as rare and special as you are is like a precious jewel. I’m so incredibly sorry for the way I’ve treated you. If you find it in your heart to forgive me, in the future I will treat you like the cherished treasure you are.",
	"Darling, you deserve far, far better than the way I’ve treated you. Please forgive me and allow me to come back into your life.",
	"Please forgive my foolish, insensitive words and actions and allow me the chance to change and grow into the kind of man you truly deserve.",
	"You’re beautiful, both inside and out. A woman as rare and amazing as you are ought to be treated with the utmost love, care, and respect. I’m so sorry I dropped the ball as your boyfriend. Please forgive me.",
	"I haven’t been able to stop thinking about all the ways I let you down. Please forgive me and give me another chance.",
	"I’m not going to make any excuses for what I’ve done or said because my words and actions are inexcusable. Instead, I want to offer my most sincere apology and express my hope that you’ll forgive me and we can get back together again so I can show you that I’ve learned from my past.",
	" will wait for your to the eternity if that’s what it takes to earn your forgiveness.\nSorry dear. I understand my mistake.",
	"Our relation was supposed to be immune to the earthly diseases called fighting, arguing and lies. Now i have to take the counter measure called sorry to save this beautiful relationship.\nI am really sorry baby.",
	"Your bitterness is something i can not stand. Please forgive me for my mistakes and let us continue our sweet relation again.",
	"You are my strength, yet you are angry to me. I feel very weak and exposed. Please accept my deepest apologies and let us unite again. We are not meant to be apart.",
	"You are the best thing that ever happened to me and i was really stupid to not realize that till now. I know i have made a lots of mistakes, but give me another chance. I will never let you leave me again. I am really very sorry.",
	"They say that everything happens for the best. This small fight of ours made me realize your worth to me. I don’t ever want to fight you again. I love you so much and i am very very sorry. Please forgive me.",
	"I have an utmost trust in the God and i know that you will forgive me soon. Till then i am waiting.\nI am sorry for everything.",
	"I want to be your pillow again for all the nights to come. I want to take care of you all the night and all the day. I miss you, baby. I want to hug you again. I want to feel you again. I can not bear anymore. Please forgive me baby. I deeply regret our fight. Give me another chance.",
	"After you have left me, it seems like my life has stopped. I am stuck with you. My heart and my memories are still living in the past. I love you so much. I am really very sorry for what happened.\nPlease forgive me.",
	"After leaving you, my life has thrown all the hardships on me, and I realize that you are my lucky charm, without you, I can not even face a single hardship. I guess that was nature’s way of reminding me about my biggest mistake. I am sorry, and I miss you so much. I hope you feel the same about me.",
	"I know that we have moved apart, but you are still living inside my heart. I don’t know I want to give our relationship another chance. I miss you so much and i am really very sorry for everything.",
	"know that i am the one who always starts an argument. I know i have done many mistakes and i realize that now, Please forgive and give me another chance. I am really sorry.",
	"I am very sorry and i want to make it up to you. Forgive me babe. Apologizing is not a bad feeling after all.",
	"Your main objective for this separation is to make me realize my mistakes. I understand now and i am very sorry baby. I was being stupid. Please come back now.",
	"I know the value of your smile and after this fight, i realize how much you mean to me. You are my one and only love and i want you to forgive me please. I apologize for everything.",
	"This sorry is not only because of my mistakes. This sorry is also because i value this relationship more than my pride and men’s pride is something that is above everything else.\n\nPlease forgive me. I am sorry!",
	" still can not imagine how stupid i am to be the reason of our separation, all i ever wanted for us to be together.\nI am sorry babe, please forgive me.",
	"On my road to redemption. I could think of nothing else other than hurting you. I want to make everything right if you give me another chance. I miss you so much, and I know my mistakes now. I am very sorry my love.",
	"This fight made me realize, how much important you are for me.\nI am very sorry.",
	"I took the first wrong step to damage this relation but i expect you to take the right step and save it from breaking. I love you and i am very sorry for my dumbness.",
	" am still living in the beautiful memories of our time together and i enjoyed those moments. I realize now that i have lost a treasure and i want to apologize for my mistakes. Please forgive me.",
	"I really though that I am very strong but ever since you have left me, I feel so weak, and I realize that the source of my strength was your love. I miss you so much. I am very sorry. Please forgive me.",
	"o one is perfect and i know i have more faults than other people but you are the only one i have given my heart because i knew it that only you are meant to hold it. 🙂\nPardon, my lady.",
	"I will wait for your forgiveness till death if you don’t forgive me now.",
	"I can not stand even a single second seeing this painful look on your face.\nBaby i am really sorry.",
	"Difficult time has passed painfully, but your memories still make me want to cry.\nI just want another chance to make it up to you. Please forgive me.",
	"As a girlfriend, it is your right to be angry with me for my mistakes. But as a boyfriend, it is my job to make amends and never stop trying till i earn my forgiveness.\n\nBaby, i sincerely apologize. Please forgive my childish behaviour.",
	"I am going through our last chat again. I am looking at your pictures. I am even stalking you on your social circle. You know, these are my habits when I miss you, and I can not do anything about that. Please forgive me for my mistakes. I just want to hold you in my arms right now.",
	"Every man should be given another chance. Because men are prideful and stupid.\nI realize my mistake and i ask for your forgiveness.",
	"I am sorry for being jealous. It’s just that I’m afraid of losing the best thing to have ever happened to me.",
	"Being my girlfriend I know you have the right to be angry. But don’t forget that being your boyfriend, I too have the right to pamper you until you accept my apology. I am sorry.",
	"Being sorry is the first step to repentance, and repentance is the first step to being a better person. So if you don’t forgive me, I will never be able to become a better boyfriend. I am sorry.",
	"I made a mistake because I am only human. But I expect you to forgive me because I know that you are Supergirl. I am sorry.",
	"Ever since the day I broke your heart, I may have lost your trust but I gained something much more powerful – the urge to make you fall in love with me all over again. I am sorry.",
	"I know that I don’t look handsome when I wear anger on my face. Sorry for looking so ugly the other day. I love you.",
	"If I had a time machine, you wouldn’t be reading this message right now because I would have gone back in time and undone the hurt I caused you. I regret my actions badly and I am very sorry.",
	"I don’t want to make any grand promises. All I want to do is hug you and tell you how much you mean to me. I’m sorry.",
	"If I begin to tell you how terrible I feel for what I did to you, my apology will run into days, weeks and months. To cut a long story short, I am really sorry.",
	"I know that my lies have damaged our relationship beyond repair. But I want you to know that I still care. I know it will be very hard for you to forgive me. But I want you to look into my eyes to see that I am truly sorry. I love you.",
	"I wish I had that neuralyzer which Will Smith uses in Men in Black to erase someone’s memory. Then I could erase all the horrible things I did to hurt you. Sorry.",
	"I have realized that it doesn’t matter how much I care about you, until I actually show it. Sorry.",
	"Last night I can’t sleep, I wasn’t able to eat my lunch properly,\nAnd I feel so disturbed the whole day.\nI think the only thing that can take all those away is your smile.\nPlease, smile for me and say that you forgive me.",
	"I feel terrible about hurting you. Of all people, you are the one I hurt. I want to apologize deeply and I hope you can forgive me. I love you and this time, I will be the right man for you.",
	"I now know how hard it is without you. I’m sorry for what happened. Forgive me please. I miss you like crazy.",
	"I can’t sleep and I can’t eat. It’s you in my mind and in my heart. Please tell me how to live without you. I miss you so much and I hope you can forgive me.",
	"It is said that we offend people we are afraid to lose the most. Forgive me, my love.",
	"Though I’m not the best man for you, but you for me are the best woman on the planet! I’m sorry, I was wrong.",
	"My heart is crying without you and the world around has dimmed, please, bring colors into my life! I love you.",
	"The whole world is black and white when you’re not next to me. I am ready to give everything just to hear you laugh again. I’m sorry, let’s be together again.",
	"Let forgiveness in your heart replace the anger in your soul. You are my treasure, forgive me.",
	"Let my apology fly to you through kilometers and I hope that it touches the strings of your soul. You are a great woman and a great person, I hope that we will be together.",
	"I am ready to go to the end of the world, only to see your smile once again. You make me better, forgive me if sometimes I do something wrong.",
	"My dear, you are so beautiful that I am always jealous! Forgive me if sometimes I behave stupidly, I’m drunk in love.",
	"When you cry, the part of my soul dies, I never wanted to cause your tears, forgive me, my love, I understood my mistakes.",
	"I am sorry that I’ve let you down, give me the chance to change your mind about me.",
	"Beloved, let this quarrel be our greatest misfortune. We are all humans and we all make mistakes, let’s forgive each other, and will continue to love and care for each other.",
	"I did not realize how much you worth and I was guided just by appearances, things are not the same when I’m with you, I need your love, your advice. I really apologize. If you want, I kneel before you to end this situation. I wish we can have a relationship full of love and peace. I love you with all my heart.",
	"My darling, I feel terrible for what I did, can you please forgive me? Since I’m by your side you have supported me in everything, I need you please! you complete me!. My life, I ask you to forgive me and give me a chance to correct my mistakes, I’m willing to do whatever you want to fix this situation.",
	"Please let me show you that I have changed and I feel very sorry for what I did, I beg you to apologize me and let me stay with you. Let’s start our relationship again. Please receive my apologies to return harmony to our hearts and I guarantee you it will never happen again. I’m willing to do anything you ask to have your forgiveness.",
	"Once again I come back to beg you to forgive me, I made a mistake, I ignored your warnings and your good advice, I judged you the wrong way and I did not believe in what you said. It’s sad to wake up every day thinking that I hurt you. If you don’t forgive me now, I will understand, but I promise you I will move heaven and earth to gain that forgiveness.",
	"You always look gorgeous and beautiful and I made you look so ugly the other day by causing you pain. I’m really sorry beautiful.",
	"Being alone today made me realize my mistakes and I want you to know that I regret my actions. I’m so sorry my woman.",
	"No vows or promises, I just want to say that I’m truly and really sorry my princess.",
	"I hope by hugging and telling you how much you mean to me will create a place in your heart to forgive me. I’m so sorry my love.",
	"I want you to know that I still love and care about you, even though I hurt your feelings. I’m really sorry my angel.",
	"I only want you to look into my eyes and see how sorry I am for having cause you pains. I’m so sorry my baby. Can you please forgive me?",
	"A day like this, I wish I had the power to cleanse all the terrible things I did to hurt you. I’m really sorry my love.",
	"Saying that I’m sorry doesn’t really matter much as showing you how much I mean those three words – I’m Truly Sorry.",
	"Didn’t know that being too jealous will bring about this pain and ache to you. I’m so sorry dear.",
	"My flaws and shortcomings are always before me, but I vow to be a better person next time. I’m sorry my love.",
	"The feeling of being without you, I can’t help nor stand it anymore. I’m very sorry my princess.",
	"I know now it’s not cool to hurt you or take you for granted. I’m deeply sorry sweetheart.",
	"It pains me when I’m the reason behind why you’re angry. I’m so sorry my baby.",
	"I know that you are truly hurt now, I could only hope this will make it up to you – I Am Truly Sorry My Love.",
	"All that matters right now is that I still love you beyond words, please accept my apology. I’m sorry beautiful.",
	"Please accept my apology, I promise to cherish and love you more than ever before. I’m sorry for everything.",
	"Henceforth I will always be real and true to you, my dear. I’m so sorry my baby. Please forgive me.",
	"Go ahead and blame it all on me, because it was all my fault. I’m really sorry sweetheart.",
	"It was wrong of me to take advantage of you or your kind gesture. I’m very sorry my love.",
	"I hope you can forgive me and give me another chance to prove my love for you. I’m truly sorry my baby.",
	"I may have been wrong but if I don’t do this, I’ll never be right. I apologize.",
	"If I could avoid what happened, I would, but since I can’t, I’ll apologize.",
	"You are the kindest person I have met. Forgive this fool who can’t live without you.",
	"Our future hangs on this note of apology! Accept it and change my life forever.",
	"I know saying sorry once won’t help. So here… sorry * infinity. Accept my apologies.",
	"The hardest to say but the easiest to acknowledge is a five letter word – Sorry. I said it, will you acknowledge it?",
	"Saying sorry can revive our relationship and let it blossom like before. I miss you sweetheart and I love you.",
	"I am sorry if I hurt you, I didn’t mean to. You are the love of my life. Come back to me.",
	"S-O-R-R-Y.",
	"For old times’ sake, accept my apology. I want to be with you again, don’t keep me away.",
	"Our relationship is important to me and here comes a sorry for you to forgive me and forget what I said.",
	"My world is a better place because of you. Don’t walk away. I am sorry.",
	"If you won’t hold me, I’ll cry, if you won’t be with me, I may not survive and if you don’t accept this apology, I’ll surely die.",
	"I apologize not because I am wrong but because I value our relationship more than my ego.",
	"Saying sorry is the first step to restoring a broken relationship. I said it but will you accept it?",
	"The genie granted me 1 wish. I asked for world peace. ‘No’ he said. I asked for your forgiveness. He said he he’d try world peace.",
	"You are the brightest ray of light in my life. Your anger makes my world dark. Please forgive me.",
	"You are as sweet as honey. You are as bright as the sun. If you accept my apology, you’ll be my number 1.",
	"Things were said in haste, things happened against fate, but if you do accept my apology, everything will be better again.",
	"If not for me, accept this apology for the bond we share.",
	"I hope you accept this apology, for it comes not only with the deepest regrets but with feelings so pure, that it’d make a pearl seem tainted.",
	"Words are rare for a feeling so pure, saying sorry won’t suffice.",
	"If I could take back my words I would, but since I can’t – here is a new set: I am sorry!",
	"You have the heart of an angel; forgive me my love, for I will never do this again.",
	"I may not be the best but I love you better than the rest, accept my apologies and be mine again.",
	"Our life is like a flower in spring. If you leave, you’ll take away the essence! Come back and let’s be together again.",
	"If I could, I would take back all the things I did to hurt you. But since I can’t, please make do with my apologies.",
	"I feel like I am the worst, most awful person in the entire world. I am so, so sorry for getting angry at you. I promise that I will never do it again if only you will just forgive me, my love.",
	"I never wanted to make you angry. You are so beautiful when you smile, and it is my fault that the smile left your face. Please forgive me and smile again, my dear.",
	"I am so sorry that I was being clingy. I just cannot get enough of you. You are the only thing that is ever on my mind.",
	"They say that every couple fights, but I wish that we never had to have a bad day. I am so sorry that I was the reason we had a fight. I was wrong, and I am sorry.",
	"Sticks and stones may break our bones, but words can hurt too. I never realized the harm words could do until I hurt you with them. I am so sorry—what said is truly unforgivable.",
	"I promise that I will try to think more before I speak. I did not mean the things that I said to you, but I was so angry that I said anything, even when it was not true. I hope you know that I did not mean what I said. I need to have you as a part of my life",
	"I don’t know what I can say other than to apologize for being such a jerk. If you could find it in yourself to look past my mistakes and forgive me, I will do my best to stop being such a jerk and to become the person you deserve.",
	"You are the brightest ray of sunshine in my entire life. When you are upset with me, my world goes dark. Please forgive me so that my world can be light again.",
	"I hope that you will accept my apology. It comes with the deepest regrets and love. I wish that I could be the person you deserve, but I will have to keep trying.",
	"Your spirit and love are so pure that even a pearl would feel tainted. If only I was worthy of that. I am so sorry for showing you just how little I deserve you. If you will forgive me, I will try to be a better person.",
	"I was a stupid idiot. You deserve better, and I will try to become a better person. I am so sorry—will you please forgive me?",
	"I am desolate without you. Please forgive me.",
	"I am sorry. All I want to do is to have our relationship blossom as strong as it did before. I miss you, sweetheart. Please forgive me.",
	"I have caused you so much pains in your heart and Yet full of regret, I can’t still turn back the hands of time and now the only thing I have left to do is to beg for your forgiveness please forgive me I’m sorry.",
	"Life without forgiveness is a life without achievements. I’m sorry from the depths of my heart. Please forgive me.",
	"I did be lying if I told you losing you were something I could handle. Can you come back to me please?",
	"I know I’ve done you wrong and my conscience is judging me. I’m truly sorry; forgive me so I can have a rest of mind. Please I’m sorry.",
	"I hurt you now but that doesn’t mean I hate you also. Honey I’m sorry I did you wrong.",
	"Whether intentional or not, I know that I’ve hurt you and I’m sorry from the bottom of my heart. Please forgive me.",
	"One thing I never wanted to see is your tears, but now I am the one making you cry. It’s hard to accept that we can’t be together. I’m sorry.",
	"There is always a room for forgiveness. Find it in your heart and give us a chance",
	"There are many times I treat you wrong. Please forgive me and I promise you no more such undeserving treatments.",
	"I know I hurt you and now you hate me but please try to find a place in your heart to forgive me.",
	"Sometimes when I hurt you, I just hope that you’ll forgive me because I’ve never meant to.",
	"Forgive me whatever I did, I’ve never meant to hurt you. You’re my one and only love.",
	"As I walked out of my house today, I realized I was missing something, and that something was you. Please be mine again.",
	"I do not get to see you as often as I like, I do not get to hold you all through the night, but deep in my heart this much I know. You are the one for me and I will never let you go. Please come back to me.",
	"Like a bee I stung you with my previous actions,I am very sorry honey I hope you forgive me for the sake of better days ahead.",
	"I am sorry for being human who is prone to making mistakes,please forgive  my angel.",
	"I have wept all day long because my heart bites me for hurting you this much.I am sorry.",
	"My weakness is no excuse for hurting you,please find a place in your heart to forgive me and give me strength to come alive again.",
	"There is no perfect excuse for my mistake,but I am not perfect so kindly excuse my errors and forgive me.",
	"I am your greatest fan but I am so sorry to have hurt you like a blade ,I hope you forgive me so that I can be cool again because my life feels terribly hot without you.",
	"I never meant to take you for granted,please I beg you to grant me a pardon for my mistake.",
	"I feel so negative because of my actions towards you,please make me a positive person again by forgiving me.",
	"I feel so sad and lonely because my better half is angry with me,please play your angelic role in my life by forgiving me and making me whole again.",
	"Please don’t hate me for my past mistakes because there is still enough love to last us through the future.I am very sorry.",
	"I cannot undo my mistake but I can correct it by saying a big sorry for being a jerk.See my jerk face.",
	"I’m imprisoned by the guilt I feel over my mistake,please forgive me and release my silly action from your mind.",
	"Not everything is what it seems,my mistake was not deliberate and I to apologize for it because what matters is I love you.",
	"To err is human to forgive is divine.I erred , please find it within your divine heart to forgive me because you are my angel.",
	"Don’t turn your back on our love because of my mistake,please leave the past behind, and let us embrace a better tomorrow starting from now. I am truly sorry.",
	"I am trembling as I type this because my eyes hurt with tears,my fingers are feeble with pain and my heart is burning with regret for hurting you. I am truly sorry.",
	"Text can’t reveal the content of my heavy heart that feel so bad for hurting you. I am sorry honey.",
	"My mistake is inexcusable so I want you to kindly pardon me for behaving so horribly wrong. I am truly sorry.",
	"Perfect love has no manual for such an imperfect world, so bear my imperfection and forgive me for the sake of our love.",
	"Love they say is blind, but I can clearly see how much I hurt you with my mistake, please forgive me and turn a blind eye against my mistake.",
	"Baby cupid is mad at me for hurting you, please forgive me and allow love to continue its perfect job in our lives.",
	"I acted immature please be matured enough to pardon my childish act.",
	"Unconditional love forgives conditions such as mistakes,please let your love pardon me for my unintentional errors.",
	"I never believed I could hurt you this much,please believe I am truly sorry for my mistake.",
	"The truth is that I fumbled but the fact is I never meant to,the question can you forgive me ? Please pardon my truly sorry heart for hurting you.",
	"I respect you more than my wrong act could ever show,please give a clean chance to prove how truly sorry I am.",
	"Saying I am sorry is not easy because it shows one is at fault.please I am so sorry for causing you pain through my act.",
	"A billion I am sorry text is not enough to measure the hurt I feel over my mistake. Please give me the chance to make it up to you.",
	"I should get locked up for hurting such a special person as you , I promise not to make this mistake again. I am truly sorry.",
	"Sometimes, you hurt the one’s you love the most. I promise to make it better if you give “us” one more chance.",
	"Your love is my drug and you must know, I’m terribly addicted to you.",
	"Every minute without you feels like precious time gone down the drain. Please let's not waste any more of it?"
]
